<template>
  <section class="container">
    <h2 class="text-3xl font-semibold mb-6 text-center">
      Рекомендации после протезирования зубов
    </h2>
    <div class="grid grid-cols-1 md:grid-cols-2 lg:grid-cols-3 gap-5">
      <div
        v-for="(item, i) in arr"
        :key="i"
        class="px-6 py-4 rounded-md bg-yellow-100"
      >
        <p>{{ item }}</p>
      </div>
    </div>
  </section>
</template>

<script setup lang="ts">
const arr = [
  "Первое время после протезирования зубов возможно будет дискомфорт, ноющая боль",
  "При сильной боли примите обезболивающее нестероидное противовоспалительное средство (ибупрофен, парацетамол, нимесил)",
  "Уделите особое внимание гигиене полости рта, чистке зубов и межзубных пространств",
  "Не забывайте о регулярном полоскании рта - каждые 1.2 часа (раствор: 1 ложка соды и соли в 200 мл холодной, но кипяченой воды)",
  "Так же поможет полоскание травяными отварами (календула, шалфей) ",
  "Если боль не исчезает и усиливается, перерастает в пульсирующую примите к примеру «диклофенак»",
  "Обязательное использование ирригатора для гигиены полости рта необходимо всем у кого установлены коронки",
];
</script>
