<template>
  <section id="service" class="container">
    <h2 class="mb-6 font-medium text-3xl md:text-4xl text-center">
      Услуги клиники
    </h2>
    <div class="grid grid-cols-1 md:grid-cols-2 gap-5">
      <div
        v-for="(service, i) in services"
        class="border p-5 rounded-lg shadow-lg bg-white"
      >
        <img
          :src="`/images/services/${i + 1}.webp`"
          :alt="service.title"
          class="aspect-[2/1] rounded-md mb-3"
        />
        <h3 v-text="service.title" class="title" />
        <p v-text="service.text" class="text" />
      </div>
    </div>
  </section>
</template>

<script setup lang="ts">
const services = [
  {
    title: "Коронки",
    text: "Эстетичное восстановление зубов для безупречной улыбки. Подробности о современных материалах: Япония, Китай, Германия, а также выгодные предложения на установку.",
  },
  {
    title: "Протезирование",
    text: "От пластмассовых протезов до инновационных решений из биополимеров. Мы поможем вернуть вам комфорт и уверенность в улыбке с индивидуальным подходом к каждому случаю.",
  },
  {
    title: "Имплантация",
    text: "Современные технологии имплантации зубов в 2 этапа. Гарантированная безопасность и комфорт для пациентов. Узнайте о среднем уровне цен и сравните с вашим городом.",
  },
  {
    title: "Лечение кариеса",
    text: "Эффективное лечение кариеса без боли и стресса. Современные материалы и технологии для сохранения здоровья ваших зубов с гарантией качества.",
  },
  {
    title: "Удаление зубов",
    text: "Безопасное и безболезненное удаление зубов у лучших стоматологов региона. Узнайте о выгодных предложениях и о том, как избежать осложнений.",
  },
];
</script>
